_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_1 (Conv2D)            (None, 64, 32, 100)       1664
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 64, 16, 50)        0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 128, 16, 50)       204928
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 128, 8, 25)        0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 256, 8, 25)        295168
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 512, 8, 25)        1180160
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 512, 8, 26)        0
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 512, 4, 13)        0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 512, 4, 13)        2359808
_________________________________________________________________
flatten_1 (Flatten)          (None, 26624)             0
_________________________________________________________________
dense_1 (Dense)              (None, 4096)              109056000
_________________________________________________________________
dropout_1 (Dropout)          (None, 4096)              0
_________________________________________________________________
dense_2 (Dense)              (None, 4096)              16781312
_________________________________________________________________
dropout_2 (Dropout)          (None, 4096)              0
_________________________________________________________________
dense_3 (Dense)              (None, 88172)             361240684
=================================================================
Total params: 491,119,724
Trainable params: 491,119,724
Non-trainable params: 0
_________________________________________________________________